app/Controllers/admin/transaksi.php

    public function selesai($id_transaksi)
    {
        // Ambil data transaksi berdasarkan id_transaksi
        $transaksi = $this->transaksi->find($id_transaksi);
---
SELECT *
FROM `tbl_transaksi`
WHERE `tbl_transaksi`.`id_transaksi` = '15'