app/Controllers/admin/transaksi.php

    public function tambah()
    {
        $data = [
            'anggota' => $this->anggota->findAll(),
            'buku' => $this->buku->findAll(),
        ];
---
SELECT *
FROM `tbl_anggota`
SELECT *
FROM `tbl_buku`

    public function simpan()
    {
        $id_anggota = $this->request->getPost('id_anggota');
        $tanggal_peminjaman = $this->request->getPost('tanggal_peminjaman');
        $tanggal_pengembalian = $this->request->getPost('tanggal_pengembalian');
        $id_buku_list = $this->request->getPost('id_buku'); // Array of book IDs

        // Simpan data transaksi
        $this->transaksi->save([
            'id_anggota' => $id_anggota,
            'tanggal_peminjaman' => $tanggal_peminjaman,
            'tanggal_pengembalian' => $tanggal_pengembalian,
        ]);
---
INSERT INTO `tbl_transaksi` (`id_anggota`, `id_buku`, `tanggal_peminjaman`, `tanggal_pengembalian`) VALUES ('9', '18', '2024-05-13', '2024-05-14')

    public function update($id_transaksi)
    {
        $id_anggota = $this->request->getPost('id_anggota');
        $tanggal_peminjaman = $this->request->getPost('tanggal_peminjaman');
        $tanggal_pengembalian = $this->request->getPost('tanggal_pengembalian');
        $id_buku_list = $this->request->getPost('id_buku'); // Array of book IDs

        // Update data transaksi
        $this->transaksi->update($id_transaksi, [
            'id_anggota' => $id_anggota,
            'tanggal_peminjaman' => $tanggal_peminjaman,
            'tanggal_pengembalian' => $tanggal_pengembalian,
        ]);

        // Hapus detail transaksi lama
        $this->detailTransaksi->where('id_transaksi', $id_transaksi)->delete();
---
DELETE FROM `tbl_transaksi`
WHERE `id_transaksi` IN ('15')

    public function selesai($id_transaksi)
    {
        // Ambil data transaksi
        $transaksi = $this->transaksi->find($id_transaksi);

        // Ambil detail transaksi terkait
        $detailTransaksi = $this->detailTransaksi->where('id_transaksi', $id_transaksi)->findAll();

        if ($transaksi) {
            // Memulai transaksi database
            $this->db->transStart();

            // Simpan data transaksi yang selesai ke histori transaksi
            $this->historiTransaksi->save([
                'id_anggota' => $transaksi['id_anggota'],
                'tanggal_peminjaman' => $transaksi['tanggal_peminjaman'],
                'tanggal_pengembalian' => $transaksi['tanggal_pengembalian'],
                // Tambahkan kolom lain sesuai kebutuhan
            ]);
            $id_histori_transaksi = $this->historiTransaksi->insertID();

            // Simpan detail transaksi yang selesai ke histori detail transaksi
            foreach ($detailTransaksi as $detail) {
                $this->historiDetailTransaksi->save([
                    'id_histori_transaksi' => $id_histori_transaksi,
                    'id_buku' => $detail['id_buku'],
                    // Tambahkan kolom lain sesuai kebutuhan
                ]);
            }

            // Hapus data transaksi dari tabel transaksi
            $this->transaksi->delete($id_transaksi);

            // Hapus detail transaksi terkait
            $this->detailTransaksi->where('id_transaksi', $id_transaksi)->delete();
---
SELECT *
FROM `tbl_transaksi`
WHERE `tbl_transaksi`.`id_transaksi` = '18'
SELECT *
FROM `tbl_detail_transaksi`
WHERE `id_transaksi` = '18'
INSERT INTO `tbl_histori_transaksi` (`id_anggota`, `tanggal_peminjaman`, `tanggal_pengembalian`) VALUES ('4', '2024-05-02', '2024-05-18')
INSERT INTO `tbl_histori_detail_transaksi` (`id_histori_transaksi`, `id_buku`) VALUES (11, '20')
DELETE FROM `tbl_transaksi`
WHERE `id_transaksi` IN ('18')
DELETE FROM `tbl_detail_transaksi`
WHERE `id_transaksi` = '18'