app/Controllers/admin/transaksi.php

    public function simpan()
    {
        $id_anggota = $this->request->getPost('id_anggota');
        $tanggal_peminjaman = $this->request->getPost('tanggal_peminjaman');
        $tanggal_pengembalian = $this->request->getPost('tanggal_pengembalian');
        $id_buku_list = $this->request->getPost('id_buku'); // Array of book IDs

        // Simpan data transaksi
        $this->transaksi->save([
            'id_anggota' => $id_anggota,
            'tanggal_peminjaman' => $tanggal_peminjaman,
            'tanggal_pengembalian' => $tanggal_pengembalian,
        ]);
---
INSERT INTO `tbl_pengembalian` (`id_anggota`, `id_buku`, `tanggal_peminjaman`, `tanggal_pengembalian`, `tanggal_dikembalikan`, `telat`) VALUES ('9', '18', '2024-05-13', '2024-05-14', '2024-05-15', 1)