app/Controllers/auth.php

    public function login()
    {
        // Ambil data dari form login
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Panggil model untuk melakukan pengecekan login
        $userModel = new userModels(); // Ubah nama kelas model
        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `tbl_user`
WHERE `email` = 'admin@123'
 LIMIT 1