app/Models/pengembalianModels.php

    function getAll()
    {
        $builder = $this->db->table('tbl_pengembalian');
        $builder->join('tbl_anggota', 'tbl_anggota.id_anggota = tbl_pengembalian.id_anggota')
            ->join('tbl_buku', 'tbl_buku.id_buku = tbl_pengembalian.id_buku');
        $query = $builder->get();
---
SELECT *
FROM `tbl_pengembalian`
JOIN `tbl_anggota` ON `tbl_anggota`.`id_anggota` = `tbl_pengembalian`.`id_anggota`
JOIN `tbl_buku` ON `tbl_buku`.`id_buku` = `tbl_pengembalian`.`id_buku`