app/Models/transaksiModels.php

    public function getAll()
    {
        $builder = $this->db->table($this->table);
        $builder->join('tbl_anggota', 'tbl_anggota.id_anggota = tbl_transaksi.id_anggota');
        $query = $builder->get();
---
SELECT *
FROM `tbl_transaksi`
JOIN `tbl_anggota` ON `tbl_anggota`.`id_anggota` = `tbl_transaksi`.`id_anggota`
JOIN `tbl_buku` ON `tbl_buku`.`id_buku` = `tbl_transaksi`.`id_buku`

    public function getTransaksiWithDetails($id_transaksi = null)
    {
        $builder = $this->db->table('tbl_transaksi');
        $builder->select('tbl_transaksi.*, tbl_anggota.nama_anggota')
            ->join('tbl_anggota', 'tbl_anggota.id_anggota = tbl_transaksi.id_anggota')
            ->groupBy('tbl_transaksi.id_transaksi');

        if ($id_transaksi !== null) {
            $builder->where('tbl_transaksi.id_transaksi', $id_transaksi);
        }

        $query = $builder->get();
---
SELECT `tbl_transaksi`.*, `tbl_anggota`.`nama_anggota`
FROM `tbl_transaksi`
JOIN `tbl_anggota` ON `tbl_anggota`.`id_anggota` = `tbl_transaksi`.`id_anggota`
WHERE `tbl_transaksi`.`id_transaksi` = '21'
GROUP BY `tbl_transaksi`.`id_transaksi`

    public function getDetailByTransaksi($id_transaksi)
    {
        return $this->db->table('tbl_detail_transaksi')
            ->select('tbl_buku.judul, tbl_transaksi.tanggal_peminjaman, tbl_transaksi.tanggal_pengembalian')
            ->join('tbl_transaksi', 'tbl_transaksi.id_transaksi = tbl_detail_transaksi.id_transaksi')
            ->join('tbl_buku', 'tbl_buku.id_buku = tbl_detail_transaksi.id_buku')
            ->where('tbl_detail_transaksi.id_transaksi', $id_transaksi)
            ->get()
            ->getResult();
---
SELECT `tbl_buku`.`judul`, `tbl_transaksi`.`tanggal_peminjaman`, `tbl_transaksi`.`tanggal_pengembalian`
FROM `tbl_detail_transaksi`
JOIN `tbl_transaksi` ON `tbl_transaksi`.`id_transaksi` = `tbl_detail_transaksi`.`id_transaksi`
JOIN `tbl_buku` ON `tbl_buku`.`id_buku` = `tbl_detail_transaksi`.`id_buku`
WHERE `tbl_detail_transaksi`.`id_transaksi` = '21'